In [1]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn
np.random.seed(101)

rand_matrix = randn(5,4)

In [6]:
rand_matrix

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [7]:
pd.DataFrame(data = rand_matrix)

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [8]:
pd.DataFrame(data = rand_matrix, index = 'A B C D E'.split())

          0         1         2         3
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
"Dhruvi is cute".split()

['Dhruvi', 'is', 'cute']

In [11]:
"Dhruvi loves panda".split()

['Dhruvi', 'loves', 'panda']

In [14]:
df= pd.DataFrame(data = rand_matrix, index = 'A B C D E'.split(), columns = "India USA China Japan".split())
df

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df['India']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: India, dtype: float64

In [16]:
type(df['India'])

pandas.core.series.Series

In [22]:
my_list_of_columns = df["India","Japan"]

KeyError: ('India', 'Japan')

In [ ]:
my_list_of_columns

In [23]:
df[["India","Japan"]]

      India     Japan
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [24]:
df

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df['NEW'] = df['India'] + df['Japan']

In [27]:
df

      India       USA     China     Japan       NEW
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [31]:
df.drop('NEW', axis = 1)

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.drop('NEW', axis = 1, inplace = False)

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df.drop('NEW', axis = 1, inplace = True)

In [34]:
df.drop('A')

      India       USA     China     Japan
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selecting rows

In [44]:
df.loc['A']

India    2.706850
USA      0.628133
China    0.907969
Japan    0.503826
Name: A, dtype: float64

In [38]:
df.iloc[:2]

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [42]:
df.iloc[1]

India    0.651118
USA     -0.319318
China   -0.848077
Japan    0.605965
Name: B, dtype: float64

In [45]:
df.loc[['A','D']]

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [46]:
df.iloc[0:3]

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [65]:
df.iloc[0:2,0:2]

      India       USA
A  2.706850  0.628133
B  0.651118 -0.319318